In [44]:
import pandas as pd
import numpy as np
lista = [1,4,6,8,9]
#Invertir una lista correctamente.
lista2 = [2,8,2,4,6]
lista3 = ["a4","b6","c7","t2","x4"]
dicc = dict(x = lista,y=lista2,z=lista3)

Ejercicio 64: Seleccionar Registros según el rango de los valores de una columna

In [45]:
df = pd.DataFrame(dicc)
df

   x  y   z
0  1  2  a4
1  4  8  b6
2  6  2  c7
3  8  4  t2
4  9  6  x4

In [46]:
#Solo queremos los registros donde el valor de y sea entre 4 y 8
df[df["y"].between(4,8)] #Los límites se consideran.

   x  y   z
1  4  8  b6
3  8  4  t2
4  9  6  x4

In [47]:
#Queremos los registros que en x vayan de 1 a 4 pero en y de 6 a 8
condicion = (df["x"].between(1,4)) & (df["y"].between(6,8))
df[condicion]

   x  y   z
1  4  8  b6

Ejercicio 65: Determinar los datos en un dataframe que son nulos

In [48]:
lista = [np.nan,2,np.nan,4,5]
#Invertir una lista correctamente.
lista2 = list(reversed(lista))
lista3 = ["a4","b6","c7","t2","x4"]
dicc = dict(x = lista,y=lista2,z=lista3)

In [49]:
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

In [50]:
#Se nos devuelve un Dataframe donde 
df.isna()

       x      y      z
0   True  False  False
1  False  False  False
2   True   True  False
3  False  False  False
4  False   True  False

* Entonces con esto podríamos traer registros que sean nulos en determinada columna

In [51]:
#Por ejemplo deseamos traer aquellos registros que sean nulos en Y
df[df.isna()["y"]]

     x   y   z
2  NaN NaN  c7
4  5.0 NaN  x4

* Esto lo podemos replicar para cualquiera de nuestras columnas

Ejercicio 66: Encontrar Datos en un DataFrame que no son nulos

In [52]:
#Caso contrario al ejercicio anterior.
df.notna() #Nos devuelve un dataframe de booleanos, donde Verdadero sea aquel que nos ea nulo

       x      y     z
0  False   True  True
1   True   True  True
2  False  False  True
3   True   True  True
4   True  False  True

* Entonces si quisieramos los registros donde en la variable x no sean nulos...

In [53]:
df[df.notna()["x"]]

     x    y   z
1  2.0  4.0  b6
3  4.0  2.0  t2
4  5.0  NaN  x4

Ejercicio 67: "Como acceder a un valor único, atraves de su fila y columna"

In [54]:
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

In [55]:
#Supongamos que deseamos saber el valor del registro con indice 3, pero de la coumna z
df.at[2,"x"]
df.at[3,"z"]

't2'

Ejercicio 68: Reemplazar un valor específico a traves de su fila y columna

In [56]:
#Simplemente hacemos una asignacion y reemplazamos--tambien funciona loc
df.at[2,"x"]  = 9 #su valor anterior es nan, ahora sera 9

* Comprobamos

In [57]:
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  9.0  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

Ejercicio 69: Modificando una columna, según la condicion de otra atraves de loc

In [58]:
import numpy as np
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

In [59]:
#Modificaremos el valor de la columna "x" según la columna "y"
#Si en Y es NAN automaticamente x debería tener en esa misma fila un FALSE
condicion = np.isnan(df["y"])
df.loc[condicion,"x"] = True #recibimos una condicion, y hacemos que la columna adquiera un valor. 
df

      x    y   z
0   NaN  5.0  a4
1   2.0  4.0  b6
2  True  NaN  c7
3   4.0  2.0  t2
4  True  NaN  x4

In [60]:
df.loc[3,"x"]

4.0

Ejercicio 71: Sumar los Valores de una Columna de un DataFrame con sum

In [61]:
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

Sumaremos los valores de la columna "y"

In [62]:
df["y"].sum()

11.0

Ejercicio 72: Acceder a una entrada de un DataFrame utilizando Índices Numéricos

In [63]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

* Que haríamos si tenemos indices no númericos y aun así quisieramos emplearlos?

In [64]:
#Usariamos la funcion iat, quiero el registro 3 de la columna 2
df.iat[2,1]

nan

Ejercicio 72: Calcular el valor promedio de una columna en dataframe

In [65]:
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

In [66]:
#Para esto mejor nos deshacemos de los datos nulos
df.dropna(inplace=True)

In [67]:
df

     x    y   z
1  2.0  4.0  b6
3  4.0  2.0  t2

In [68]:
#Promedio en Y
df["y"].mean()

3.0

Ejercicio 73: Insertar una columna en una posición específica.

In [69]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [70]:
#Insertaremos una columna llamada "xyz", después de "y" con los datos de una lista
lista = [1,2,3,4,5]
#Los parametros son posicion, nombre_columna y valores
df.insert(2,"xyz",lista) #En este caso no puede insertar una columna ya existente.

In [71]:
df

     x    y  xyz   z
a  NaN  5.0    1  a4
b  2.0  4.0    2  b6
c  NaN  NaN    3  c7
d  4.0  2.0    4  t2
e  5.0  NaN    5  x4

* Recreemos lo anterior pero con la funcion assign

In [72]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [79]:
lista = [1,2,3,4,5]
df = df.assign(xyz = lista) #Debes igualar para ahcer notorio el cambio
df

   x    y   z  xyz
a  1  5.0  a4    1
b  2  4.0  b6    2
c  3  NaN  c7    3
d  4  2.0  t2    4
e  5  NaN  x4    5

In [80]:
#Podemos de esta manera poner xyz en segundo lugar
df = df.reindex(columns=["x","xyz","y","z"]) #Cambia de orden las columnas.
df

   x  xyz    y   z
a  1    1  5.0  a4
b  2    2  4.0  b6
c  3    3  NaN  c7
d  4    4  2.0  t2
e  5    5  NaN  x4

Ejercicio 75: Agregar una nueva fila mediante la funcion loc.

In [81]:
df = pd.DataFrame(dicc)
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4

In [82]:
df.loc[5] = [7,0,"c5"] #Con esto podemos agregar un registro al final
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  NaN  NaN  c7
3  4.0  2.0  t2
4  5.0  NaN  x4
5  7.0  0.0  c5

In [83]:
#Pero de igual forma podríamos reemplazar un registro. #No se insertará. 
df.loc[2] = [1,1,"i1"]
df

     x    y   z
0  NaN  5.0  a4
1  2.0  4.0  b6
2  1.0  1.0  i1
3  4.0  2.0  t2
4  5.0  NaN  x4
5  7.0  0.0  c5

Ejercicio 76: Recorrer cada una de las Columnas de un Objeto DF con items.

In [84]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [85]:
#¿Como recorrer con un for un data frame? Pues como siempre lo hacemos. 
for etiqueta,contenido in df.items():
    print(etiqueta)
    print(contenido)

x
a    NaN
b    2.0
c    NaN
d    4.0
e    5.0
Name: x, dtype: float64
y
a    5.0
b    4.0
c    NaN
d    2.0
e    NaN
Name: y, dtype: float64
z
a    a4
b    b6
c    c7
d    t2
e    x4
Name: z, dtype: object

Ejercicio 77: Eliminar una fila con la funcion drop

In [86]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [87]:
df.drop(index="a",inplace=True) #Le pasamos el indice del registro y lo dropeamos.
df

     x    y   z
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

* Forma más rapida

In [88]:
df.drop("d",inplace=True)
df

     x    y   z
b  2.0  4.0  b6
c  NaN  NaN  c7
e  5.0  NaN  x4

Ejercicio 78: Obtener en Modo Descendente por Diferentes Columnnas

In [89]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [92]:
#Ordenar de forma ascendente o descdente por columnas
df.sort_values(by=["y"],ascending=[False])

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
d  4.0  2.0  t2
c  NaN  NaN  c7
e  5.0  NaN  x4

In [93]:
df.sort_values(by=["y"],ascending=[True]) #Si desea mas criterios solo debe aumentar la lista

     x    y   z
d  4.0  2.0  t2
b  2.0  4.0  b6
a  NaN  5.0  a4
c  NaN  NaN  c7
e  5.0  NaN  x4

Ejercicio 79: Iterar con la función itertuples un DF por filas a modo de tuplas nombradas

In [94]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

     x    y   z
a  NaN  5.0  a4
b  2.0  4.0  b6
c  NaN  NaN  c7
d  4.0  2.0  t2
e  5.0  NaN  x4

In [95]:
#Nos devuelve cada fila como si fuera una tuplas
for registro in df.itertuples():
    print(registro)
#Atraves de esto quizás se nos pueda facilitar manipular datos numéricos

Pandas(Index='a', x=nan, y=5.0, z='a4')
Pandas(Index='b', x=2.0, y=4.0, z='b6')
Pandas(Index='c', x=nan, y=nan, z='c7')
Pandas(Index='d', x=4.0, y=2.0, z='t2')
Pandas(Index='e', x=5.0, y=nan, z='x4')

Ejercicio 80: Reemplazar valores de una columna con la funcion map de un Dataframe

In [96]:
lista = [1,4,6,8,9]
#Invertir una lista correctamente.
lista2 = [2,8,2,4,6]
lista3 = ["M","F","F","M","F"]
dicc = dict(x = lista,y=lista2,z=lista3)

In [97]:
df = pd.DataFrame(dicc,index=["a","b","c","d","e"])
df

   x  y  z
a  1  2  M
b  4  8  F
c  6  2  F
d  8  4  M
e  9  6  F

In [98]:
#aplicamos una funcion map a una columna para cambiar sus valores
#esto puede ser util para tenerlos como si fueran numeros. 
df["z"] = df["z"].map({"M":"Varon","F":"Mujer"}).astype(str)

In [99]:
df

   x  y      z
a  1  2  Varon
b  4  8  Mujer
c  6  2  Mujer
d  8  4  Varon
e  9  6  Mujer